app/controllers/home_controller.rb

SELECT "websitesis".* FROM "websitesis"
---
  def index
	@websitesi = Websitesi.all.map(&:adresi).sample