app/controllers/websitesis_controller.rb

  def index
    @websitesis = Websitesi.all
---
SELECT "websitesis".* FROM "websitesis"

  def create
    @websitesi = Websitesi.new(websitesi_params)

    respond_to do |format|
      if @websitesi.save
---
INSERT INTO "websitesis" ("adresi", "created_at", "updated_at") VALUES (?, ?, ?)  [["adresi", "www.google.com"], ["created_at", "2015-10-28 18:02:16.068542"], ["updated_at", "2015-10-28 18:02:16.068542"]]

    def set_websitesi
      @websitesi = Websitesi.find(params[:id])
---
SELECT  "websitesis".* FROM "websitesis" WHERE "websitesis"."id" = ? LIMIT 1  [["id", 5]]